"""Module for solving task_2: functions and datatypes for site's customers statistics.

Task_2:
Напишите модуль,
в котором функция process_data принимает путь к json-файлу с данными о клиентах сайта
(пример файла в data_hw2.json) и путь к json-файлу вывода.

Функция process_data записывает в этот общий json статистику:
минимальный, максимальный, средний и медианный возраст пользователя,
а также средний возраст клиентов,
которые были онлайн менее двух дней, недели, месяца, полугода, и более полугода назад.
"""
